PureEngineering/PUREmodules/nrf52/modules_examples/soil_detector_ble/main.c
		//if we recevie 0xAA from the phone then we start reading data from fdc2214 chip
		//NRF_LOG_RAW_INFO("start read *********************> %x\n", startRead);
		if(startRead == 0xAA) {
			startRead = 0xAA;
			fdc2214_sleep_mode_local(FDC_WAKE);
		//	startRead = 0x00;
		
			uint8_t channel = 0;
			uint32_t data = fdc2214_readchannel(m_twi_master, channel); 
			NRF_LOG_RAW_INFO("CH0 === ,%d,\n", data); NRF_LOG_FLUSH();
			fdc_chx_characteristic_update(&m_fdcs_service, &data, m_fdcs_service.ch0_char_handles.value_handle);
			
			channel = 1;
			//NRF_LOG_RAW_INFO("print to ble reach\n");
			data = fdc2214_readchannel(m_twi_master, channel); 
			NRF_LOG_RAW_INFO("CH1 === ,%d,\n", data); NRF_LOG_FLUSH();
			fdc_chx_characteristic_update(&m_fdcs_service, &data, m_fdcs_service.ch1_char_handles.value_handle);
		
	        /******COMMENT IT BACK WHEN YOU ARE CONNECTED TO CHANNEL 2 *******************************/	
			channel = 2;
			
			data = fdc2214_readchannel(m_twi_master, channel); 
			NRF_LOG_RAW_INFO("CH2 === ,%d,\n", data); NRF_LOG_FLUSH();
			fdc_chx_characteristic_update(&m_fdcs_service, &data, m_fdcs_service.ch2_char_handles.value_handle);
			//startRead = 0x00;
		}
		
		//NRF_LOG_RAW_INFO("timer count -----------------------> %d\n", timer_count);
		if(timer_count == 5) {
			//fdc2214_sleep_mode_local(FDC_SLEEP);
			//startRead = 0x00;
			timer_count = 0;
			//app_timer_stop(sensor_loop_timer_id);
		}
		timer_count++;
		
}


static void sensor_loop_handler(void * p_context)
{
   print_to_ble();  
}

static void create_sensor_timer()
{   

    uint32_t err_code;

    // Create timers
	err_code = app_timer_create(&sensor_loop_timer_id, APP_TIMER_MODE_REPEATED, sensor_loop_handler);
	APP_ERROR_CHECK(err_code);
		err_code = app_timer_start(sensor_loop_timer_id, APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), NULL);
		APP_ERROR_CHECK(err_code);

}



/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_nus    Nordic UART Service structure.
 * @param[in] p_data   Data to be send to UART module.
 * @param[in] length   Length of the data.
 */
/**@snippet [Handling the data received over BLE] */
static void fdcs_data_handler(ble_fdcs_t * p_nus, uint8_t * p_data, uint16_t length)
{
    timer_count = 0; //reset timer once receives data from the phone
	
	create_sensor_timer(); //start timer;
    //save the data from the phone to startRead (checking for 0xAA)
	startRead = p_data[0];
    for (uint32_t i = 0; i < length; i++)
    {       
	
        while (app_uart_put(p_data[i]) != NRF_SUCCESS);
    }

    while (app_uart_put('\r') != NRF_SUCCESS);
    while (app_uart_put('\n') != NRF_SUCCESS);
}

/**@snippet [Handling the data received over BLE] */


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t       err_code;
    ble_fdcs_t    fdcs_data_receiver;

    memset(&fdcs_data_receiver, 0, sizeof(fdcs_data_receiver));

    fdcs_data_receiver.data_handler = fdcs_data_handler;

    ble_fdcs_init(&m_fdcs_service, &fdcs_data_receiver);
   // APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

