PureEngineering/PUREmodules/nrf52/modules_examples/soil_detector_ble/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for placing the application in low power state while waiting for events.
 *//*
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}*/



/**
 * @brief Initialize the master TWI
 *
 * Function used to initialize master TWI interface that would communicate with simulated EEPROM.
 *
 * @return NRF_SUCCESS or the reason of failure
 */
static ret_code_t twi_master_init(void)
{
    ret_code_t ret;
    const nrf_drv_twi_config_t config =
    {
       .scl                = TWI_SCL_M,
       .sda                = TWI_SDA_M,
       .frequency          = NRF_TWI_FREQ_400K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
       .clear_bus_init     = false
    };

    ret = nrf_drv_twi_init(&m_twi_master, &config, NULL, NULL);

    if (NRF_SUCCESS == ret)
    {
        nrf_drv_twi_enable(&m_twi_master);
    }

    return ret;
}






// start the timer to transmit data to a phone when the fdc2214 connects to a phone
// it stop transmitting data when it is disconnected
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;

//	gpio_init();
	
	
    /* Initializing TWI master interface for SuperSensor */
    err_code = twi_master_init();
    APP_ERROR_CHECK(err_code);

    APP_ERROR_CHECK(NRF_LOG_INIT(NULL));

    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    uart_init();
		
		
		
   // buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
    bsp_board_leds_init();
	//it inits with sleep mode on
	fdc2214_init(m_twi_master);
	fdc2214_sleep_mode_local(FDC_SLEEP);


	NRF_LOG_RAW_INFO("UART Start!------->\n\r");  NRF_LOG_FLUSH();
	err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
	
	//sleep_mode_enter();
  

  //  create_sensor_timer();

    // Enter main loop.
    for (;;)
    {
	
		// NRF_LOG_RAW_INFO("startread----> %x\n", startRead); NRF_LOG_FLUSH();
	//	NRF_LOG_FLUSH(); 
	
		  err_code = sd_app_evt_wait();
	 // err_code = sd_power_system_off();
	      APP_ERROR_CHECK(err_code);
		
				// __WFE();
				// __SEV();
				// __WFE();
	
    }
	
}


/**
 * @}
 */
